In [5]:
import pandas as pd
import numpy as np

In [36]:
student_subject = {'drani':['economics', 'physics', 'maths'], 'oliver':['biology', 'physics', 'chemistry']}

In [37]:
student_subject

{'drani': ['economics', 'physics', 'maths'],
 'oliver': ['biology', 'physics', 'chemistry']}

In [38]:
df = pd.DataFrame(student_subject)

In [39]:
df

       drani     oliver
0  economics    biology
1    physics    physics
2      maths  chemistry

In [43]:
for student, subject in student_subject.items():
    print(f'Subjects offered by {student}')
    print('-' * 40)
    for sub in subject:
        print(sub)

Subjects offered by drani
----------------------------------------
economics
physics
maths
Subjects offered by oliver
----------------------------------------
biology
physics
chemistry

In [50]:
column = ['No', 'Name', 'sex', 'age']
df = pd.Series(column, index=['a', 'b', 'c', 'd'])
df

a      No
b    Name
c     sex
d     age
dtype: object

In [63]:
calories = {"day1": 420, "day2": 380, "day3": 390,"day4": 420, "day5": 380, "day6": 390}

myvar = pd.Series(calories, index=['day1', 'day2'])
myvar

day1    420
day2    380
dtype: int64

In [64]:
df = pd.DataFrame(calories, index=[1, 2, 3, 4, 5, 6])
df

   day1  day2  day3  day4  day5  day6
1   420   380   390   420   380   390
2   420   380   390   420   380   390
3   420   380   390   420   380   390
4   420   380   390   420   380   390
5   420   380   390   420   380   390
6   420   380   390   420   380   390

In [65]:
df.head()

   day1  day2  day3  day4  day5  day6
1   420   380   390   420   380   390
2   420   380   390   420   380   390
3   420   380   390   420   380   390
4   420   380   390   420   380   390
5   420   380   390   420   380   390

In [66]:
df.tail()

   day1  day2  day3  day4  day5  day6
2   420   380   390   420   380   390
3   420   380   390   420   380   390
4   420   380   390   420   380   390
5   420   380   390   420   380   390
6   420   380   390   420   380   390

In [67]:
df.index

Index([1, 2, 3, 4, 5, 6], dtype='int64')

In [68]:
df.columns

Index(['day1', 'day2', 'day3', 'day4', 'day5', 'day6'], dtype='object')

In [69]:
n = df.to_numpy()

In [70]:
n

array([[420, 380, 390, 420, 380, 390],
       [420, 380, 390, 420, 380, 390],
       [420, 380, 390, 420, 380, 390],
       [420, 380, 390, 420, 380, 390],
       [420, 380, 390, 420, 380, 390],
       [420, 380, 390, 420, 380, 390]])

In [71]:
df.describe()

        day1   day2   day3   day4   day5   day6
count    6.0    6.0    6.0    6.0    6.0    6.0
mean   420.0  380.0  390.0  420.0  380.0  390.0
std      0.0    0.0    0.0    0.0    0.0    0.0
min    420.0  380.0  390.0  420.0  380.0  390.0
25%    420.0  380.0  390.0  420.0  380.0  390.0
50%    420.0  380.0  390.0  420.0  380.0  390.0
75%    420.0  380.0  390.0  420.0  380.0  390.0
max    420.0  380.0  390.0  420.0  380.0  390.0

In [72]:
df.T

        1    2    3    4    5    6
day1  420  420  420  420  420  420
day2  380  380  380  380  380  380
day3  390  390  390  390  390  390
day4  420  420  420  420  420  420
day5  380  380  380  380  380  380
day6  390  390  390  390  390  390

In [73]:
df

   day1  day2  day3  day4  day5  day6
1   420   380   390   420   380   390
2   420   380   390   420   380   390
3   420   380   390   420   380   390
4   420   380   390   420   380   390
5   420   380   390   420   380   390
6   420   380   390   420   380   390

In [77]:
df.sort_index(axis=1, ascending=True)

   day1  day2  day3  day4  day5  day6
1   420   380   390   420   380   390
2   420   380   390   420   380   390
3   420   380   390   420   380   390
4   420   380   390   420   380   390
5   420   380   390   420   380   390
6   420   380   390   420   380   390

In [78]:
df.sort_values(by='day3')

   day1  day2  day3  day4  day5  day6
1   420   380   390   420   380   390
2   420   380   390   420   380   390
3   420   380   390   420   380   390
4   420   380   390   420   380   390
5   420   380   390   420   380   390
6   420   380   390   420   380   390

In [81]:
df[3:5]

   day1  day2  day3  day4  day5  day6
4   420   380   390   420   380   390
5   420   380   390   420   380   390

In [83]:
df.loc[3]

day1    420
day2    380
day3    390
day4    420
day5    380
day6    390
Name: 3, dtype: int64

In [89]:
df.loc[0:3,['day1','day2']]

   day1  day2
1   420   380
2   420   380
3   420   380

In [90]:
df.isna()

    day1   day2   day3   day4   day5   day6
1  False  False  False  False  False  False
2  False  False  False  False  False  False
3  False  False  False  False  False  False
4  False  False  False  False  False  False
5  False  False  False  False  False  False
6  False  False  False  False  False  False

In [91]:
df.mean()

day1    420.0
day2    380.0
day3    390.0
day4    420.0
day5    380.0
day6    390.0
dtype: float64

In [93]:
df.min()

day1    420
day2    380
day3    390
day4    420
day5    380
day6    390
dtype: int64

In [94]:
df.max()

day1    420
day2    380
day3    390
day4    420
day5    380
day6    390
dtype: int64

In [96]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})

In [97]:
left

   key  lval
0  foo     1
1  bar     2

In [98]:
right

   key  rval
0  foo     4
1  bar     5

In [103]:
mr = pd.merge(left, right, on='key')

In [104]:
mr

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [105]:
df = pd.DataFrame(
    np.random.randn(1000, 4), index=ts.index, columns=["A", "B", "C", "D"]
)

NameError: name 'ts' is not defined